In [1]:
print("Hello world")

Hello world

In [3]:
!pip install pandas

Access is denied.

In [4]:
!pip install --user pandas

Access is denied.

In [5]:
import sys
!{sys.executable} -m pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [6]:
import pandas as pd
print(pd.__version__)

2.2.3

In [10]:
import pandas as pd

data = [1, 2, 3, 4]
df = pd.DataFrame(data)
print(df)

   0
0  1
1  2
2  3
3  4

In [15]:
import pandas as pd

data = [1,2,3,8]
res = pd.DataFrame(data)
print(type(data))
print(res)

<class 'list'>
   0
0  1
1  2
2  3
3  8

In [18]:
s = pd.Series(data)
s

0    1
1    2
2    3
3    8
dtype: int64

In [19]:
type(s)

pandas.core.series.Series

In [22]:
#create a dataframe from the series
# this is show column name, how to create column name or index name i has explain it 

res = pd.DataFrame(s, columns=['num'])
res

   num
0    1
1    2
2    3
3    8

In [23]:
data

[1, 2, 3, 8]

In [28]:
# crate a dataframe from the list
# import pandas as pd
df =  pd.DataFrame(data, columns=['nums2'])
df

   nums2
0      1
1      2
2      3
3      8

In [31]:
# convert dataframe to series 
# my dataframe name is nums2 
s2 = df['nums2']
s2

0    1
1    2
2    3
3    8
Name: nums2, dtype: int64

In [32]:
type(s2)

pandas.core.series.Series

In [33]:
# crate 2d list
data = [[1,2], [3,4], [4,6]]
data

[[1, 2], [3, 4], [4, 6]]

In [46]:
# create a dataframe from the list and rename the columns

df = pd.DataFrame(data, columns=['num1', 'num2'])
df

   num1  num2
0     1     2
1     3     4
2     4     6

In [51]:
type(df)

pandas.core.frame.DataFrame

In [49]:
# 2d list dataframe convert to the series

s = df[['num1', 'num2']]
print(s)

   num1  num2
0     1     2
1     3     4
2     4     6

In [50]:
type(s)

pandas.core.frame.DataFrame

In [53]:
# how to create dictionary
data = {
'Name' : ['Tamim', 'Hannan', 'Mannan'],
'age' : [20, 30, 40],
'city' : ['Dhaka', 'Chandpur', 'Faridganj']
}

df = pd.DataFrame(data)
print(df)

     Name  age       city
0   Tamim   20      Dhaka
1  Hannan   30   Chandpur
2  Mannan   40  Faridganj

In [56]:
# how to covert dictionary to series

s= pd.Series(data['Name'], name='Name')
print(s)

0     Tamim
1    Hannan
2    Mannan
Name: Name, dtype: object

In [57]:
age_col = pd.Series(data['age'])
print(age_col)

0    20
1    30
2    40
dtype: int64

In [59]:
age_cl = df['age']
print(age_cl)

0    20
1    30
2    40
Name: age, dtype: int64

In [60]:
# how to declare set

s = {1,2,3,4,5}
s

{1, 2, 3, 4, 5}

In [61]:
type(s)

set

In [62]:
# how to convert set into the series
# but set doesn't convert into the series. then first convert set into the list or tuple then we will convert it series

se = pd.Series(list(s))
se

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [63]:
type(se)

pandas.core.series.Series

In [69]:
# how to convert set into the datafreame

df = pd.DataFrame(s, columns =['key'])
df

   key
0    1
1    2
2    3
3    4
4    5

In [70]:
# tuple to series and dataframe

t = (1,2,3,4,5)
s = pd.Series(t)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [71]:
df = pd.DataFrame(t)
df

   0
0  1
1  2
2  3
3  4
4  5

In [73]:


t = (1,2,3,4,5, True, False)
s = pd.Series(t)
s

0        1
1        2
2        3
3        4
4        5
5     True
6    False
dtype: object

In [74]:
df = pd.DataFrame(t)
df

       0
0      1
1      2
2      3
3      4
4      5
5   True
6  False

In [75]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       7 non-null      object
dtypes: object(1)
memory usage: 188.0+ bytes

In [76]:
# creating  a dataFrame with integer data
# i have mentioned the dictionary
data = {
    'age' : [25, 30, 14, 40],
    'Salary' : [5000, 6000, 4000, 2000]
}
print(data)

{'age': [25, 30, 14, 40], 'Salary': [5000, 6000, 4000, 2000]}

In [77]:
df = pd.DataFrame(data)
df

   age  Salary
0   25    5000
1   30    6000
2   14    4000
3   40    2000

In [78]:
# df a full informaiton show korbe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     4 non-null      int64
 1   Salary  4 non-null      int64
dtypes: int64(2)
memory usage: 196.0 bytes

In [79]:
# but we need now just see which type of datatype we are use our dictionary
df.dtypes

age       int64
Salary    int64
dtype: object

In [89]:
# changed data type range 

df['age'] = df['age'].astype('int32')
df['Salary'] = df['Salary'].astype('int32')
print(df)

   age  Salary  salary
0   25    5000    5000
1   30    6000    6000
2   14    4000    4000
3   40    2000    2000

In [90]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     4 non-null      int32
 1   Salary  4 non-null      int32
 2   salary  4 non-null      int32
dtypes: int32(3)
memory usage: 180.0 bytes

In [91]:
df.dtypes

age       int32
Salary    int32
salary    int32
dtype: object

In [92]:
df['age'] = df['age'].astype('int16')
df['Salary'] = df['Salary'].astype('int16')
df

   age  Salary  salary
0   25    5000    5000
1   30    6000    6000
2   14    4000    4000
3   40    2000    2000

In [93]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     4 non-null      int16
 1   Salary  4 non-null      int16
 2   salary  4 non-null      int32
dtypes: int16(2), int32(1)
memory usage: 164.0 bytes

In [94]:
2**16

65536

In [95]:
# create dictionary
data = {
'Name' : ['Tamim', 'Hannan', 'Mannan'],
    'Age' : [24, 26, 20],
    'Occupation' : ['Data Scientist', 'Software engineer', 'Teacher'],
    'Salary' : [600000, 40000, 21520]    
}

data

{'Name': ['Tamim', 'Hannan', 'Mannan'],
 'Age': [24, 26, 20],
 'Occupation': ['Data Scientist', 'Software engineer', 'Teacher'],
 'Salary': [600000, 40000, 21520]}

In [96]:
df = pd.DataFrame(data)
df

     Name  Age         Occupation  Salary
0   Tamim   24     Data Scientist  600000
1  Hannan   26  Software engineer   40000
2  Mannan   20            Teacher   21520

In [97]:
print(df.dtypes)

Name          object
Age            int64
Occupation    object
Salary         int64
dtype: object

In [98]:
data = {
'Name' : ['Tamim', 'Hannan', 'Mannan'],
    'Age' : [24, 26, 20],
    'Occupation' : ['Data Scientist', 'Software engineer', 'Teacher'],
    'Salary' : ['600000 euro', '40000 euro', '21520 euro']    
}
data

{'Name': ['Tamim', 'Hannan', 'Mannan'],
 'Age': [24, 26, 20],
 'Occupation': ['Data Scientist', 'Software engineer', 'Teacher'],
 'Salary': ['600000 euro', '40000 euro', '21520 euro']}

In [99]:
df.dtypes

Name          object
Age            int64
Occupation    object
Salary         int64
dtype: object

In [101]:
# create a list of dates

dates = ['2023-10-04', '2024-11-15', '2025-01-01']

df = pd.DataFrame({'Date': dates})
df

         Date
0  2023-10-04
1  2024-11-15
2  2025-01-01

In [104]:
# create a list of dates

dates = ['2023-10-04', '2024-11-15', '2025-01-01']

df = pd.DataFrame({'Date': dates})


# check the data type of the 'Date' column
df['Date'].dtype

dtype('O')

In [106]:
# how to check date time data type

timestamps = pd.to_datetime(dates)
df = pd.DataFrame({'Date2' : timestamps})
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date2   3 non-null      datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 156.0 bytes

In [107]:
df

       Date2
0 2023-10-04
1 2024-11-15
2 2025-01-01

In [108]:
dates = ['2023', '2024', '2025']

df = pd.DataFrame({'Date': dates})
timestamps = pd.to_datetime(dates)
df2 = pd.DataFrame({'Date2' : timestamps})
df

   Date
0  2023
1  2024
2  2025

In [109]:
# data ar modde jodi month and date mention na thake tahole auto generate kore ney
df2

       Date2
0 2023-01-01
1 2024-01-01
2 2025-01-01

In [110]:
# convert it neno second


dates = ['2023-10-04 12:34:56.123456789', '2024-11-15 15:23:45.987654321']

timestamps = pd.to_datetime(dates)
df = pd.DataFrame({'Date' : timestamps})

df

                           Date
0 2023-10-04 12:34:56.123456789
1 2024-11-15 15:23:45.987654321

In [111]:
print(df['Date'].dtype)

datetime64[ns]

In [112]:
# conver it into the series

timestamps = pd.to_datetime(dates)
series = pd.Series(timestamps, name='dates')
series

0   2023-10-04 12:34:56.123456789
1   2024-11-15 15:23:45.987654321
Name: dates, dtype: datetime64[ns]

In [113]:
print(series)

0   2023-10-04 12:34:56.123456789
1   2024-11-15 15:23:45.987654321
Name: dates, dtype: datetime64[ns]

In [128]:
# Reading Data from csv/excel
# xlsx(excel workbook)
# csv(common separated values)

# df = pd.read_excel(r'C:\Users\Tamim\OneDrive\Documents\anaconda_projects\db\Data.xlsx', sheet_name='Sheet2')
df

    Age  Salary
0     1    1000
1     2    2000
2     3    3000
3     4    4000
4     5    5000
5     6    6000
6     7    7000
7     8    8000
8     9    9000
9    10   10000
10   11   11000
11   12   12000
12   13   13000
13   14   14000
14   15   15000
15   16   16000
16   17   17000
17   18   18000
18   19   19000
19   20   20000
20   21   21000
21   22   22000
22   23   23000
23   24   24000
24   25   25000
25   26   26000
26   27   27000
27   28   28000
28   29   29000
29   30   30000
30   31   31000
31   32   32000
32   33   33000
33   34   34000
34   35   35000
35   36   36000

In [133]:
# how to data read excel.csv file

df = pd.read_csv(r'C:\Users\Tamim\OneDrive\Documents\anaconda_projects\db\Datacsv-Sheet1.csv')
df

    serial   Salary
0         1    1000
1         2    2000
2         3    3000
3         4    4000
4         5    5000
5         6    6000
6         7    7000
7         8    8000
8         9    9000
9        10   10000
10       11   11000
11       12   12000
12       13   13000
13       14   14000
14       15   15000
15       16   16000
16       17   17000
17       18   18000